Autodesk.Revit.DB.FamilyPointPlacementReference.PointReference
The reference on which the point depends on.

Autodesk.Revit.DB.FamilyPointPlacementReference.Location
The location of the point.

Autodesk.Revit.DB.FamilyPointPlacementReference.Name
The name of the corresponding reference point in the Family document.

Autodesk.Revit.DB.FamilyPointPlacementReference
This object represents data corresponding to the placement references in a
certain types of Family Instances (see examples listed below).
Remarks: Examples of FamilyInstance objects that contain placement references are Panels
and Flexible Components.